---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.WarningInFamilyDismissed
source: html/a2dd2e16-6db0-ad0a-325b-2195a5bfc01b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.WarningInFamilyDismissed Property

A warning in family "[Name]" was dismissed. Please review warning information to determine if any changes are necessary\nWarning Information:\n"[Text]"

## Syntax (C#)
```csharp
public static FailureDefinitionId WarningInFamilyDismissed { get; }
```